import { RegionMapping } from "../interface/region.interface";

export const SIDO_NAME_MAP: Record<string, string> = {
    '서울': '서울특별시',
    '부산': '부산광역시',
    '대구': '대구광역시',
    '인천': '인천광역시',
    '광주': '광주광역시',
    '대전': '대전광역시',
    '울산': '울산광역시',
    '세종': '세종특별자치시',
    '경기': '경기도',
    '강원': '강원도',
    '충북': '충청북도',
    '충남': '충청남도',
    '전북': '전라북도',
    '전남': '전라남도',
    '경북': '경상북도',
    '경남': '경상남도',
    '제주': '제주특별자치도'
  };
  
  export const REGION_MAPS: RegionMapping[]  = [
    // 수도권
  {
    regId: '11B10101', // 서울
    regions: [
      { sido: '서울', guguns: ['종로구', '중구', '용산구', '성동구', '광진구', '동대문구', '중랑구', '성북구', '강북구', '도봉구', '노원구', '은평구', '서대문구', '마포구', '양천구', '강서구', '구로구', '금천구', '영등포구', '동작구', '관악구', '서초구', '강남구', '송파구', '강동구'] }
    ]
  },
  {
    regId: '11B20201', // 인천
    regions: [
      { sido: '인천', guguns: ['중구', '동구', '미추홀구', '연수구', '남동구', '부평구', '계양구', '서구', '강화군', '옹진군'] }
    ]
  },
  {
    regId: '11B20601', // 경기 남부(수원)
    regions: [
      { sido: '경기', guguns: ['수원시', '용인시', '안성시', '화성시', '오산시', '평택시', '과천시', '군포시', '안양시', '의왕시', '안산시', '성남시', '이천시', '여주시', '광주시', '양평군', '하남시'] }
    ]
  },
  {
    regId: '11B20305', // 경기 북부(문산)
    regions: [
      { sido: '경기', guguns: ['파주시', '고양시', '양주시', '의정부시', '동두천시', '포천시', '가평군', '연천군', '구리시', '남양주시', '광명시', '시흥시', '김포시', '부천시'] }
    ]
  },

  // 충청북도, 세종
  {
    regId: '11C10301', // 충북(청주)
    regions: [
      { sido: '충북', guguns: ['청주시', '청원군', '증평군', '괴산군', '진천군', '충주시', '음성군', '제천시', '단양군', '옥천군', '영동군', '보은군'] }
    ]
  },
  {
    regId: '11C20404', // 세종
    regions: [
      { sido: '세종', guguns: ['세종시'] }
    ]
  },

  // 충청남도, 대전
  {
    regId: '11C20101', // 충남
    regions: [
      { sido: '충남', guguns: ['공주시', '논산시', '계룡시', '금산군', '천안시', '아산시', '예산군', '연기군', '서산시', '태안군', '당진군', '홍성군', '보령시', '서천군', '청양군', '부여군'] }
    ]
  },
  {
    regId: '11C20401', // 대전
    regions: [
      { sido: '대전', guguns: ['동구', '중구', '서구', '유성구', '대덕구'] }
    ]
  },

  // 강원도 영서
  {
    regId: '11D10301', // 춘천
    regions: [
      { sido: '강원', guguns: ['춘천시', '철원군', '화천군', '양구군', '인제군', '홍천군', '횡성군', '원주시', '평창군', '영월군', '정선군'] }
    ]
  },
  {
    regId: '11D10401', // 원주
    regions: [
      { sido: '강원', guguns: ['원주시'] }
    ]
  },

  // 강원도 영동
  {
    regId: '11D20501', // 강릉
    regions: [
      { sido: '강원', guguns: ['강릉시', '동해시', '속초시', '삼척시', '태백시', '고성군', '양양군'] }
    ]
  },

  // 전라북도
  {
    regId: '11F10201', // 전주
    regions: [
      { sido: '전북', guguns: ['전주시', '완주군', '진안군', '무주군', '남원시', '임실군', '장수군', '순창군', '군산시', '김제시', '익산시', '정읍시', '부안군'] }
    ]
  },
  {
    regId: '21F10501', // 군산
    regions: [
      { sido: '전북', guguns: ['군산시'] }
    ]
  },

  // 전라남도, 광주
  {
    regId: '11F20501', // 광주
    regions: [
      { sido: '광주', guguns: ['동구', '서구', '남구', '북구', '광산구'] }
    ]
  },
  {
    regId: '11F20401', // 여수
    regions: [
      { sido: '전남', guguns: ['여수시'] }
    ]
  },
  {
    regId: '21F20801', // 목포
    regions: [
      { sido: '전남', guguns: ['목포시', '무안군', '영암군', '신안군'] }
    ]
  },

  // 제주도
  {
    regId: '11G00201', // 제주
    regions: [
      { sido: '제주', guguns: ['제주시'] }
    ]
  },
  {
    regId: '11G00401', // 서귀포
    regions: [
      { sido: '제주', guguns: ['서귀포시'] }
    ]
  },

  // 경상북도, 대구
  {
    regId: '11H10201', // 포항
    regions: [
      { sido: '경북', guguns: ['포항시'] }
    ]
  },
  {
    regId: '11H10501', // 안동
    regions: [
      { sido: '경북', guguns: ['안동시'] }
    ]
  },
  {
    regId: '11H10701', // 대구
    regions: [
      { sido: '대구', guguns: ['중구', '동구', '서구', '남구', '북구', '수성구', '달서구', '달성군'] }
    ]
  },

  // 경상남도, 부산, 울산
  {
    regId: '11H20101', // 울산
    regions: [
      { sido: '울산', guguns: ['중구', '남구', '동구', '북구', '울주군'] }
    ]
  },
  {
    regId: '11H20201', // 부산
    regions: [
      { sido: '부산', guguns: ['중구', '서구', '동구', '영도구', '부산진구', '동래구', '남구', '북구', '해운대구', '사하구', '금정구', '강서구', '연제구', '수영구', '사상구', '기장군'] }
    ]
  },
  {
    regId: '11H20301', // 경남
    regions: [
      { sido: '경남', guguns: ['창원시', '진주시', '통영시', '사천시', '김해시', '밀양시', '거제시', '양산시', '의령군', '함안군', '창녕군', '고성군', '남해군', '하동군', '산청군', '함양군', '거창군', '합천군'] }
    ]
  }

    ]

  export const REGION_MAPPINGS: RegionMapping[] = [
    // 수도권
    {
      regId: '11B00000',
      regions: [
        { sido: '서울' }, { sido: '경기' }, { sido: '인천' }
      ]
    },
    // 충청북도, 세종
    {
      regId: '11C10000',
      regions: [
        { sido: '충북' }, { sido: '세종' }
      ]
    },
    // 충청남도, 대전
    {
      regId: '11C20000',
      regions: [
        { sido: '충남' }, { sido: '대전' }
      ]
    },
    // 강원도 영서
    {
      regId: '11D10000',
      regions: [
        { 
          sido: '강원',
          guguns: [ '철원군', '화천군', '양구군', '인제군', '춘천시', '홍천군', '횡성군', '원주시', '평창군', '영월군', '정선군' ]
        }
      ]
    },
    // 강원도 영동
    {
      regId: '11D20000',
      regions: [
        {
          sido: '강원',
          guguns: [ '강릉시', '동해시', '속초시', '삼척시', '태백시', '고성군', '양양군', '통천군' ]
        }
      ]
    },
    // 전라북도
    {
      regId: '11F10000',
      regions: [
        { sido: '전북' }
      ]
    },
    // 전라남도, 광주
    {
      regId: '11F20000',
      regions: [
        { sido: '전남' }, { sido: '광주' }
      ]
    },
    // 제주도
    {
      regId: '11G00000',
      regions: [
        { sido: '제주' }
      ]
    },
    // 경상북도, 대구
    {
      regId: '11H10000',
      regions: [
        { sido: '경북' }, { sido: '대구' }
      ]
    },
    // 경상남도, 부산, 울산
    {
      regId: '11H20000',
      regions: [
        { sido: '경남' }, { sido: '울산' }, { sido: '부산' }
      ]
    }
  ];